{
  "_name_or_path": "gpt2",
  "activation_function": "gelu_new",
  "architectures": [
    "GPT2ForSequenceClassification"
  ],
  "attn_pdrop": 0.1,
  "bos_token_id": 50256,
  "embd_pdrop": 0.1,
  "eos_token_id": 50256,
  "id2label": {
    "0": "greeting",
    "1": "goodbye",
    "2": "creator",
    "3": "name",
    "4": "hours",
    "5": "number",
    "6": "course",
    "7": "fees",
    "8": "location",
    "9": "hostel",
    "10": "event",
    "11": "document",
    "12": "floors",
    "13": "syllabus",
    "14": "library",
    "15": "infrastructure",
    "16": "canteen",
    "17": "menu",
    "18": "placement",
    "19": "ithod",
    "20": "computerhod",
    "21": "extchod",
    "22": "principal",
    "23": "sem",
    "24": "admission",
    "25": "scholarship",
    "26": "facilities",
    "27": "college intake",
    "28": "uniform",
    "29": "committee",
    "30": "random",
    "31": "swear",
    "32": "vacation",
    "33": "sports",
    "34": "salutaion",
    "35": "task",
    "36": "ragging",
    "37": "hod"
  },
  "initializer_range": 0.02,
  "label2id": {
    "admission": 24,
    "canteen": 16,
    "college intake": 27,
    "committee": 29,
    "computerhod": 20,
    "course": 6,
    "creator": 2,
    "document": 11,
    "event": 10,
    "extchod": 21,
    "facilities": 26,
    "fees": 7,
    "floors": 12,
    "goodbye": 1,
    "greeting": 0,
    "hod": 37,
    "hostel": 9,
    "hours": 4,
    "infrastructure": 15,
    "ithod": 19,
    "library": 14,
    "location": 8,
    "menu": 17,
    "name": 3,
    "number": 5,
    "placement": 18,
    "principal": 22,
    "ragging": 36,
    "random": 30,
    "salutaion": 34,
    "scholarship": 25,
    "sem": 23,
    "sports": 33,
    "swear": 31,
    "syllabus": 13,
    "task": 35,
    "uniform": 28,
    "vacation": 32
  },
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_ctx": 1024,
  "n_embd": 768,
  "n_head": 12,
  "n_inner": null,
  "n_layer": 12,
  "n_positions": 1024,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "task_specific_params": {
    "text-generation": {
      "do_sample": true,
      "max_length": 50
    }
  },
  "transformers_version": "4.36.2",
  "use_cache": true,
  "vocab_size": 50257
}
